[
    {
      "title": "Airplane!",
      "year": 1980,
      "cast": [
        "Robert Hays",
        "Julie Hagerty",
        "Leslie Nielsen",
        "Peter Graves",
        "Robert Stack",
        "Lloyd Bridges",
        "Kareem Abdul-Jabbar"
      ],
      "genres": [
        "Comedy",
        "Satire"
      ],
      "href": "Airplane!",
      "extract": "Airplane! is a 1980 American parody film written and directed by the brothers David and Jerry Zucker, and Jim Abrahams in their directorial debuts, and produced by Jon Davison. It stars Robert Hays and Julie Hagerty and features Leslie Nielsen, Robert Stack, Lloyd Bridges, Peter Graves, Kareem Abdul-Jabbar, and Lorna Patterson. It is a parody of the disaster film genre, particularly the 1957 Paramount film Zero Hour!, from which it borrows its plot, central characters, and some dialogue. It also draws many elements from Airport 1975 and other films in the Airport series. It is known for its use of surreal humor and fast-paced slapstick comedy, including visual and verbal puns, gags, running jokes, and obscure humor.",
      "thumbnail": "https://upload.wikimedia.org/wikipedia/en/2/21/Airplane%21_%281980_film%29.jpg",
      "thumbnail_width": 258,
      "thumbnail_height": 386
    },
    {
      "title": "Alex and the Doberman Gang",
      "year": 1980,
      "cast": [
        "Jack Stauffer",
        "Taurean Blacque",
        "Cindy Acker"
      ],
      "genres": [
        "Action",
        "Comedy",
        "Family"
      ],
      "href": null
    },
    {
      "title": "Alien Dead",
      "year": 1980,
      "cast": [
        "Buster Crabbe"
      ],
      "genres": [
        "Science Fiction",
        "Horror"
      ],
      "href": "Alien_Dead",
      "extract": "Alien Dead is an American horror film directed by Fred Olen Ray. Ray co-wrote the script with Martin Nicholas. The film involves a meteor hitting a houseboat, which causes the people on board to become zombies who eat alligators and eventually people.",
      "thumbnail": "https://upload.wikimedia.org/wikipedia/en/8/8f/Aliendeaddvd.jpg",
      "thumbnail_width": 272,
      "thumbnail_height": 384
    },
    {
      "title": "Alligator",
      "year": 1980,
      "cast": [
        "Robert Forster",
        "Robin Riker",
        "Henry Silva",
        "Dean Jagger"
      ],
      "genres": [
        "Horror",
        "Independent"
      ],
      "href": "Alligator_(film)",
      "extract": "Alligator is a 1980 American independent horror film directed by Lewis Teague and written by John Sayles. It stars Robert Forster, Robin Riker and Michael V. Gazzo. It also includes an appearance by actress Sue Lyon in her last screen role. Set in Chicago, the film follows a police officer and a reptile expert who track an enormous, ravenous man-eating alligator flushed down the toilet years earlier, that is attacking residents after escaping from the city’s sewers.",
      "thumbnail": "https://upload.wikimedia.org/wikipedia/en/c/c9/Alligator_poster.jpg",
      "thumbnail_width": 241,
      "thumbnail_height": 366
    },
    {
      "title": "Altered States",
      "year": 1980,
      "cast": [
        "William Hurt",
        "Blair Brown"
      ],
      "genres": [
        "Science Fiction",
        "Horror"
      ],
      "href": "Altered_States",
      "extract": "Altered States is a 1980 American science fiction body horror film directed by Ken Russell, and based on the novel of the same name by playwright and screenwriter Paddy Chayefsky. The film was adapted from Chayefsky's 1978 novel and is his final screenplay. The novel and the film are based in part on John C. Lilly's sensory deprivation research conducted in isolation tanks, under the influence of psychoactive drugs like mescaline, ketamine and LSD.",
      "thumbnail": "https://upload.wikimedia.org/wikipedia/en/f/fc/Altered_states.jpg",
      "thumbnail_width": 229,
      "thumbnail_height": 350
    },
    {
      "title": "Amber Waves",
      "year": 1980,
      "cast": [
        "Dennis Weaver",
        "Kurt Russell",
        "Fran Brill",
        "Wilford Brimley",
        "Mare Winningham"
      ],
      "genres": [
        "Drama"
      ],
      "href": null
    },
    {
      "title": "American Gigolo",
      "year": 1980,
      "cast": [
        "Richard Gere",
        "Lauren Hutton",
        "Héctor Elizondo"
      ],
      "genres": [
        "Drama",
        "Crime",
        "Noir"
      ],
      "href": "American_Gigolo",
      "extract": "American Gigolo is a 1980 American neo-noir crime drama film written and directed by Paul Schrader, and starring Richard Gere and Lauren Hutton. It tells the story of a high-priced escort in Los Angeles (Gere) who becomes romantically involved with a prominent politician's wife (Hutton), while simultaneously becoming the prime suspect in a murder case.",
      "thumbnail": "https://upload.wikimedia.org/wikipedia/en/4/43/American_gigolo_post.jpg",
      "thumbnail_width": 220,
      "thumbnail_height": 332
    },
    {
      "title": "Animalympics",
      "year": 1980,
      "cast": [
        "Billy Crystal"
      ],
      "genres": [
        "Animated"
      ],
      "href": "Animalympics",
      "extract": "Animalympics is a 1980 animated television film directed by Steven Lisberger and produced by Lisberger Studios for the NBC network. Originally commissioned as two separate specials, it spoofs the Summer and Winter Olympic Games and features the voices of Billy Crystal, Gilda Radner, Harry Shearer and Michael Fremer.",
      "thumbnail": "https://upload.wikimedia.org/wikipedia/en/8/81/Animalympics.jpg",
      "thumbnail_width": 248,
      "thumbnail_height": 402
    }
]
