[
    {
      "title": "Airplane!",
      "year": 1980,
      "cast": [
        "Robert Hays",
        "Julie Hagerty",
        "Leslie Nielsen",
        "Peter Graves",
        "Robert Stack",
        "Lloyd Bridges",
        "Kareem Abdul-Jabbar"
      ],
      "genres": [
        "Comedy",
        "Satire"
      ],
      "href": "Airplane!",
      "extract": "Airplane! is a 1980 American parody film written and directed by the brothers David and Jerry Zucker, and Jim Abrahams in their directorial debuts, and produced by Jon Davison. It stars Robert Hays and Julie Hagerty and features Leslie Nielsen, Robert Stack, Lloyd Bridges, Peter Graves, Kareem Abdul-Jabbar, and Lorna Patterson. It is a parody of the disaster film genre, particularly the 1957 Paramount film Zero Hour!, from which it borrows its plot, central characters, and some dialogue. It also draws many elements from Airport 1975 and other films in the Airport series. It is known for its use of surreal humor and fast-paced slapstick comedy, including visual and verbal puns, gags, running jokes, and obscure humor.",
      "thumbnail": "https://upload.wikimedia.org/wikipedia/en/2/21/Airplane%21_%281980_film%29.jpg",
      "thumbnail_width": 258,
      "thumbnail_height": 386
    },
    {
      "title": "Alex and the Doberman Gang",
      "year": 1980,
      "cast": [
        "Jack Stauffer",
        "Taurean Blacque",
        "Cindy Acker"
      ],
      "genres": [
        "Action",
        "Comedy",
        "Family"
      ],
      "href": null
    },
    {
      "title": "Alien Dead",
      "year": 1980,
      "cast": [
        "Buster Crabbe"
      ],
      "genres": [
        "Science Fiction",
        "Horror"
      ],
      "href": "Alien_Dead",
      "extract": "Alien Dead is an American horror film directed by Fred Olen Ray. Ray co-wrote the script with Martin Nicholas. The film involves a meteor hitting a houseboat, which causes the people on board to become zombies who eat alligators and eventually people.",
      "thumbnail": "https://upload.wikimedia.org/wikipedia/en/8/8f/Aliendeaddvd.jpg",
      "thumbnail_width": 272,
      "thumbnail_height": 384
    },
    {
      "title": "Alligator",
      "year": 1980,
      "cast": [
        "Robert Forster",
        "Robin Riker",
        "Henry Silva",
        "Dean Jagger"
      ],
      "genres": [
        "Horror",
        "Independent"
      ],
      "href": "Alligator_(film)",
      "extract": "Alligator is a 1980 American independent horror film directed by Lewis Teague and written by John Sayles. It stars Robert Forster, Robin Riker and Michael V. Gazzo. It also includes an appearance by actress Sue Lyon in her last screen role. Set in Chicago, the film follows a police officer and a reptile expert who track an enormous, ravenous man-eating alligator flushed down the toilet years earlier, that is attacking residents after escaping from the city’s sewers.",
      "thumbnail": "https://upload.wikimedia.org/wikipedia/en/c/c9/Alligator_poster.jpg",
      "thumbnail_width": 241,
      "thumbnail_height": 366
    },
    {
      "title": "Altered States",
      "year": 1980,
      "cast": [
        "William Hurt",
        "Blair Brown"
      ],
      "genres": [
        "Science Fiction",
        "Horror"
      ],
      "href": "Altered_States",
      "extract": "Altered States is a 1980 American science fiction body horror film directed by Ken Russell, and based on the novel of the same name by playwright and screenwriter Paddy Chayefsky. The film was adapted from Chayefsky's 1978 novel and is his final screenplay. The novel and the film are based in part on John C. Lilly's sensory deprivation research conducted in isolation tanks, under the influence of psychoactive drugs like mescaline, ketamine and LSD.",
      "thumbnail": "https://upload.wikimedia.org/wikipedia/en/f/fc/Altered_states.jpg",
      "thumbnail_width": 229,
      "thumbnail_height": 350
    },
    {
      "title": "Amber Waves",
      "year": 1980,
      "cast": [
        "Dennis Weaver",
        "Kurt Russell",
        "Fran Brill",
        "Wilford Brimley",
        "Mare Winningham"
      ],
      "genres": [
        "Drama"
      ],
      "href": null
    },
    {
      "title": "American Gigolo",
      "year": 1980,
      "cast": [
        "Richard Gere",
        "Lauren Hutton",
        "Héctor Elizondo"
      ],
      "genres": [
        "Drama",
        "Crime",
        "Noir"
      ],
      "href": "American_Gigolo",
      "extract": "American Gigolo is a 1980 American neo-noir crime drama film written and directed by Paul Schrader, and starring Richard Gere and Lauren Hutton. It tells the story of a high-priced escort in Los Angeles (Gere) who becomes romantically involved with a prominent politician's wife (Hutton), while simultaneously becoming the prime suspect in a murder case.",
      "thumbnail": "https://upload.wikimedia.org/wikipedia/en/4/43/American_gigolo_post.jpg",
      "thumbnail_width": 220,
      "thumbnail_height": 332
    },
    {
      "title": "Animalympics",
      "year": 1980,
      "cast": [
        "Billy Crystal"
      ],
      "genres": [
        "Animated"
      ],
      "href": "Animalympics",
      "extract": "Animalympics is a 1980 animated television film directed by Steven Lisberger and produced by Lisberger Studios for the NBC network. Originally commissioned as two separate specials, it spoofs the Summer and Winter Olympic Games and features the voices of Billy Crystal, Gilda Radner, Harry Shearer and Michael Fremer.",
      "thumbnail": "https://upload.wikimedia.org/wikipedia/en/8/81/Animalympics.jpg",
      "thumbnail_width": 248,
      "thumbnail_height": 402
    }

    { 
      "title": "Any Which Way You Can",
      "year": 1980,
      "cast": [
        "Clint Eastwood",
        "Geoffrey Lewis",
        "Sondra Locke",
        "Ruth Gordon",
        "William Smith"
      ],
      "genres": [
        "Action",
        "Comedy"
      ],
      "href": "Any_Which_Way_You_Can",
      "extract": "Any Which Way You Can is a 1980 American action comedy film directed by Buddy Van Horn and starring Clint Eastwood, with Sondra Locke, Geoffrey Lewis, William Smith, and Ruth Gordon in supporting roles. The film is the sequel to the 1978 hit comedy Every Which Way but Loose. The cast of the previous film return as Philo Beddoe (Eastwood) reluctantly comes out of retirement from underground bare-knuckle boxing to take on a champion hired by the mafia, who will stop at nothing to ensure the fight takes place, while the neo-Nazi biker gang Philo humiliated in the previous film also come back for revenge.",
      "thumbnail": "https://upload.wikimedia.org/wikipedia/en/2/29/Any_which_way_you_can.jpg",
      "thumbnail_width": 256,
      "thumbnail_height": 392
    },
    {
      "title": "The Apple",
      "year": 1980,
      "cast": [
        "Catherine Mary Stewart"
      ],
      "genres": [
        "Science Fiction",
        "Musical",
        "Comedy"
      ],
      "href": "The_Apple_(1980_film)",
      "extract": "The Apple is a 1980 science fiction musical comedy film written and directed by Menahem Golan. It stars Catherine Mary Stewart as a young singer named Bibi, who, in a futuristic 1994, signs to an evil label named Boogalow International Music. It deals with themes of conformity versus rebellion, and makes use of biblical allegory including the tale of Adam and Eve.",
      "thumbnail": "https://upload.wikimedia.org/wikipedia/en/2/2f/The-apple-poster.jpg",
      "thumbnail_width": 258,
      "thumbnail_height": 387
    },
    {
      "title": "Atlantic City",
      "year": 1980,
      "cast": [
        "Burt Lancaster",
        "Susan Sarandon"
      ],
      "genres": [
        "Crime",
        "Romance"
      ],
      "href": "Atlantic_City_(1980_film)",
      "extract": "Atlantic City is a 1980 romantic-gangster film directed by Louis Malle, and starring Burt Lancaster, Susan Sarandon, Kate Reid, Robert Joy, Hollis McLaren, Michel Piccoli and Al Waxman. A Canadian-French co-production filmed in late 1979, it was released in France and Germany in September 1980 and in the United States later that year by Paramount Pictures. The script was written by John Guare.",
      "thumbnail": "https://upload.wikimedia.org/wikipedia/en/a/a4/Atlantic_City_%281980_film%29.jpg",
      "thumbnail_width": 220,
      "thumbnail_height": 333
    },
    {
      "title": "The Attic",
      "year": 1980,
      "cast": [
        "Carrie Snodgress",
        "Ray Milland"
      ],
      "genres": [
        "Horror",
        "Thriller",
        "Drama",
        "War"
      ],
      "href": "The_Attic_(1980_film)",
      "extract": "The Attic is a 1980 American psychological horror drama film directed by George Edwards and starring Carrie Snodgress and Ray Milland.",
      "thumbnail": "https://upload.wikimedia.org/wikipedia/en/5/59/The_Attic_%281980_poster%29.jpg",
      "thumbnail_width": 253,
      "thumbnail_height": 394
    },
    {
      "title": "The Awakening",
      "year": 1980,
      "cast": [
        "Charlton Heston",
        "Susannah York",
        "Stephanie Zimbalist"
      ],
      "genres": [
        "Horror"
      ],
      "href": "The_Awakening_(1980_film)",
      "extract": "The Awakening is a 1980 British horror film directed by Mike Newell in his directorial debut and starring Charlton Heston, Susannah York, and Stephanie Zimbalist. It is the third film version of Bram Stoker's 1903 novel The Jewel of Seven Stars, following the 1970 television adaptation as The Curse of the Mummy for the TV series Mystery and Imagination, and the 1971 theatrical film by Hammer, Blood from the Mummy's Tomb. It was released by Warner Bros.",
      "thumbnail": "https://upload.wikimedia.org/wikipedia/en/8/89/Awakeningposter1980.jpg",
      "thumbnail_width": 254,
      "thumbnail_height": 390
    },
    {
      "title": "The Baltimore Bullet",
      "year": 1980,
      "cast": [
        "James Coburn",
        "Omar Sharif",
        "Ronee Blakley"
      ],
      "genres": [
        "Comedy"
      ],
      "href": "The_Baltimore_Bullet",
      "extract": "The Baltimore Bullet is a 1979 American comedy film based on the adventures of two pool hustlers in the United States.",
      "thumbnail": "https://upload.wikimedia.org/wikipedia/en/3/3c/Thebaltimorebullet_gip.jpg",
      "thumbnail_width": 258,
      "thumbnail_height": 387
    },
    {
      "title": "Battle Beyond the Stars",
      "year": 1980,
      "cast": [
        "Richard Thomas",
        "Robert Vaughn",
        "John Saxon",
        "Sam Jaffe",
        "Darlanne Fluegel",
        "George Peppard",
        "John Saxon"
      ],
      "genres": [
        "Science Fiction"
      ],
      "href": "Battle_Beyond_the_Stars",
      "extract": "Battle Beyond the Stars is a 1980 American space opera film produced by Roger Corman, directed by Jimmy T. Murakami, and starring Richard Thomas, Robert Vaughn, George Peppard, John Saxon, Sybil Danning and Darlanne Fluegel. Intended as a futuristic \"Magnificent Seven in outer space\", the screenplay was written by John Sayles with the score by James Horner and special effects designed by filmmaker James Cameron. The film was theatrically released by Corman's New World Pictures and was a moderate box office success, despite receiving mixed reviews from critics.",
      "thumbnail": "https://upload.wikimedia.org/wikipedia/en/b/b5/Battlebeyondthestars.jpg",
      "thumbnail_width": 203,
      "thumbnail_height": 302
    },
    {
      "title": "Below the Belt",
      "year": 1980,
      "cast": [
        "Regina Baff",
        "John C. Becher",
        "Mildred Burke",
        "(as herself)",
        "Firesign Theatre"
      ],
      "genres": [
        "Comedy",
        "Drama"
      ],
      "href": null
    },
    {
      "title": "Beyond Evil",
      "year": 1980,
      "cast": [
        "John Saxon",
        "Lynda Day George"
      ],
      "genres": [
        "Horror",
        "Supernatural"
      ],
      "href": "Beyond_Evil",
      "extract": "Beyond Evil is a 1980 American supernatural horror film directed by Herb Freed and starring John Saxon and Lynda Day George. Its plot follows an architect who suspects his wife is possessed by a former resident of the historic colonial mansion they have just moved into.",
      "thumbnail": "https://upload.wikimedia.org/wikipedia/en/b/b2/TromaEvil.jpg",
      "thumbnail_width": 254,
      "thumbnail_height": 386
    },
    {
      "title": "The Big Brawl",
      "year": 1980,
      "cast": [
        "Jackie Chan"
      ],
      "genres": [
        "Action",
        "Comedy",
        "Martial Arts"
      ],
      "href": "The_Big_Brawl",
      "extract": "The Big Brawl, also known as Battle Creek Brawl, is a 1980 martial arts action comedy film, which marked Jackie Chan's first attempt to break into the American movie Hollywood market. A joint American and Hong Kong action film production, it was directed by Robert Clouse and featured much of the crew from Enter the Dragon (1973).",
      "thumbnail": "https://upload.wikimedia.org/wikipedia/en/b/bd/Bigbrawlposter.jpg",
      "thumbnail_width": 257,
      "thumbnail_height": 388
    },
    {
      "title": "The Big Red One",
      "year": 1980,
      "cast": [
        "Lee Marvin",
        "Mark Hamill",
        "Robert Carradine"
      ],
      "genres": [
        "War"
      ],
      "href": "The_Big_Red_One",
      "extract": "The Big Red One is a 1980 American epic war film written and directed by Samuel Fuller, and starring Lee Marvin alongside an ensemble supporting cast, including Mark Hamill, Robert Carradine, Siegfried Rauch, Bobby Di Cicco, and Kelly Ward.",
      "thumbnail": "https://upload.wikimedia.org/wikipedia/en/6/60/Big_red_one_post.jpg",
      "thumbnail_width": 254,
      "thumbnail_height": 392
    },
    {
      "title": "The Black Marble",
      "year": 1980,
      "cast": [
        "Robert Foxworth",
        "Paula Prentiss",
        "Harry Dean Stanton"
      ],
      "genres": [
        "Crime",
        "Comedy",
        "Mystery",
        "Romance"
      ],
      "href": "The_Black_Marble",
      "extract": "The Black Marble is a 1980 mystery/romantic comedy film directed by Harold Becker and starring Robert Foxworth, Paula Prentiss and Harry Dean Stanton. It is based on the 1978 novel by Joseph Wambaugh.",
      "thumbnail": "https://upload.wikimedia.org/wikipedia/en/1/13/The_Black_Marble.jpg",
      "thumbnail_width": 254,
      "thumbnail_height": 392
    }
    
  ]
  
